<template>
  <div class="vue-stages-content container">
    <div class="vue-stages-content__title">
      <h2>Как проходит лечение в РЦ «12-й шаг»</h2>
    </div>
    <div
      class="vue-stages-content-item"
      v-for="stage of stages"
      :key="stage.id"
    >
      <span>{{ stage.id }}</span>
      <p>{{ stage.text }}</p>
    </div>
  </div>
</template>
<script lang="ts" setup>
const stages = [
  {
    id: 1,
    text: "После вашего звонка мы согласуем с вами варианты транспортировки пациента в Реабилитационный Центр. Внимание, доставка больного наркоманией или алкозависимого в Центр оплачивается отдельно. Вы также можете самостоятельно доставить пациента к нам в Центр, мы встретим вас в аэропорту или ж/д вокзале.",
  },
  {
    id: 2,
    text: "Центр находится в живописном месте в экологически чистом г. Иваново. Потрясающая природа, сосновый бор и пение птиц, свежий чистый воздух, огороженный зеленый дворик с уютными беседками все это делает духовное, физическое и психологическое исцеление пациентов максимально естественным.",
  },
  {
    id: 3,
    text: "Проживание и реабилитация проходят в небольших группах в отдельном обустроенном доме со всеми необходимыми удобствами и спортзалом. У ребят строгий распорядок дня, запрещается иметь деньги и мобильные телефоны (звонки раз в 2 недели); подробней о правилах и дисциплине Центра вы можете узнать по телефону: +7 (800) 500-89-55.",
  },
  {
    id: 4,
    text: "Послереабилитационная поддержка это одно из главных преимуществ Центра. Благодаря уникальной программе, разработанной нашими специалистами, мы добиваемся высочайших показателей и отсутствия срывов! Обучение современным специальностям, трудоустройство, помощь в жилищных вопросах, бесплатная юридическая помощь, организация встреч АА и т.д. Для родственников и близких наших пациентов каждую неделю ведутся бесплатные группы по работе с созависимостью. Наблюдение и работу с пациентом, после прохождения курса реабилитации ведет клинический психолог, помогая наладить пациентам отношения в семье и социуме.",
  },
];
</script>
<style lang="scss" scoped>
h2 {
  font-size: 35px;
}
.vue-stages-content {
  text-align: center;
  &__title {
    margin-bottom: 20px;
  }
  &-item {
    display: flex;
    justify-content: center;
    align-items: center;
    margin-bottom: 20px;
    &:nth-child(2n + 1) {
      margin-left: 100px;
    }
    & span {
      font-size: 60px;
      margin-right: 50px;
      color: var(--light-green);
    }
    & p {
      text-align: start;
      font-size: 13px;
      max-width: 800px;
    }
  }
}
</style>
